/*
*********************************************************************************************************
*
*	模块名称 : 主程序模块。
*	文件名称 : main.c
*	版    本 : V1.0
*	说    明 : 主程序
*	修改记录 :
*		版本号  日期       作者    说明
*		v1.0    2015-11-06 armfly  首发
*
*	Copyright (C), 2015-2016, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"		/* 如果要用ST的固件库，必须包含这个文件 */
#include "demo_spi_ad7606.h"


/* 定义例程名和例程发布日期 */
#define EXAMPLE_NAME	"V4-120b_AD7606（8通道16位同步ADC）spi模式例程"
#define EXAMPLE_DATE	"2015-11-06"
#define DEMO_VER		"1.0"

	u16 count1 = 0;     //外部中断0触发的次数
	u16 count2 = 0;     //外部中断3触发的次数
	
	char dir,dire;	    //判断旋转方向的符号
  u8 flag1 = 0;
	u8 flag2 = 0;
//短延时
void Delay(unsigned int z)
{
    for(;z>0;z--)
    {;}
}
/*
*********************************************************************************************************
*	函 数 名: main
*	功能说明: c程序入口
*	形    参：无
*	返 回 值: 错误代码(无需处理)
*********************************************************************************************************
*/
int main(void)
{
		
	bsp_Init();
		
	SPI1_Init();  //SPI初始化
	SPI2_Init();
  SPI1_SetSpeed(SPI_BaudRatePrescaler_8);   //配置SPI的速度
	SPI2_SetSpeed(SPI_BaudRatePrescaler_8);   //配置SPI的速度

  Init_AD9850();   //对AD9850初始化
	
	EXTI_GPIO_Config();
	EXTIX_Init();
	
	Flash_Count();      //记录单片机运行次数
	
	Demo_spi_AD7606();	/* 串行AD7606演示程序 */
	
}

